Repository: sabuka-dumbo/Portfolio-1
Catalog: Portfolio/SabaDumbadze/locale/*/LC_MESSAGES/django.po
Languages: ka

source: Saba Dumbadze
ka: საბა დუმბაძე

source: Web-Developer
ka: ვებ-დეველოპერი

source: Home
ka: მთავარი

source: About
ka: ჩემს შესახებ

source: Works
ka: სამუშაოები

source: Contact
ka: კონტაქტი

source: Hi I’m Saba Dumbadze,
ka: გამარჯობა, მე საბა დუმბაძე ვარ,

source: an experienced Web-Developer.
ka: გამოცდილი ვებ-დეველოპერი.

source: Saba Dumbadze is a skilled and innovative web developer with a strong foundation in modern web technologies, including Django, CSS, and JavaScript. As a developer, Saba is dedicated to crafting high-quality, visually appealing, and user-friendly websites that help individuals and businesses stand out in the digital landscape.
ka: საბა დუმბაძე არის უნარიანი და ინოვაციური ვებ-დეველოპერი, რომელიც ძლიერ საფუძველზეა თანამედროვე ვებ-ტექნოლოგიებში, მათ შორის Django, CSS და JavaScript. როგორც დეველოპერი, საბა მიზნად ისახავს მაღალი ხარისხის, ვიზუალურად მიმზიდველი და მომხმარებელზე ორიენტირებული ვებ-გვერდების შექმნას, რომლებიც ეხმარება პირებს და ბიზნესებს გამორჩეულად წარდგნენ ციფრულ სივრცეში.

source: See what I can do for you
ka: ნახე რას შემიძლია შენთვის

source: Strengths
ka: ძლიერ მხარეები

source: Skills in web-development
ka: უნარები ვებ-დეველოპმენტში

source: Git Version Control
ka: Git ვერსიის კონტროლი

source: Familiar with Git version control for basic collaboration, branching, and tracking changes. Able to handle commits, push/pull, and simple merges with growing confidence.
ka: გავცნობიერებული ვარ Git ვერსიის კონტროლი ძირითადი თანამშრომლობისთვის, ბრენჩინგისთვის და ცვლილებების მონიტორინგისთვის. შეძლებს კომიტების, push/pull მოქმედებებისა და მარტივი მერჯების მართვას ზრდადი ნდობით.

source: App Design
ka: აპლიკაციის დიზაინი

source: Experienced in app design, focusing on creating intuitive user interfaces and seamless user experiences. Proficient in wireframing, prototyping, and implementing design principles to enhance functionality and aesthetics.
ka: გამოცდილი აპლიკაციების დიზაინში, ყურადღებას ამახვილებს ინტუიტიურ მომხმარებლის ინტერფეისებზე და გლუვ მომხმარებლის გამოცდილებაზე. გაწვრთნილია ვაირფრეიმინგში, პროტოტაიპინგში და დიზაინის პრინციპების გამოყენებაში ფუნქციონალობისა და ესთეტიკის გასაუმჯობესებლად.

source: Math & Logic
ka: მათემატიკა & ლოგიკა

source: Strong foundation in mathematics and logical reasoning, enabling effective problem-solving and analytical thinking. Skilled in applying mathematical concepts to optimize algorithms and develop efficient solutions.
ka: ძლიერი საფუძველი მათემატიკასა და ლოგიკურ აზროვნებაში, რაც საშუალებას აძლევს ეფექტურად პრობლემების გადაჭრას და ანალიტიკურ აზროვნებას. უნარი მათემატიკური კონცეფციების გამოყენებაში ალგორითმების ოპტიმიზაციისთვის და ეფექტური გადაწყვეტილებების შექმნისთვის.

source: Web-Development
ka: ვებ-დეველოპმენტი

source: Experienced in web development, specializing in creating responsive and user-friendly websites. Proficient in front-end and back-end technologies, ensuring seamless functionality and visually appealing designs.
ka: გამოცდილი ვებ-დეველოპმენტში, სპეციალიზებული რეზპონსიურ და მომხმარებელზე ორიენტირებული ვებ-გვერდების შექმნაში. გაწვრთნილია ფრონტენდსა და ბექენდ ტექნოლოგიებში, დაიცვას გლუვი ფუნქციონალობა და ვიზუალურად მიმზიდველი დიზაინი.

source: Post-Project Support
ka: პროექტის შემდგომი მხარდაჭერა

source: Committed to providing ongoing support and maintenance even after project completion, ensuring long-term functionality and addressing any issues promptly.
ka: მოვალეობილი ვარ უწყვეტი მხარდაჭერისა და მოვლა-პატრონობის მიწოდებაზე პროექტის დასრულების შემდეგაც, რათა უზრუნველყოს გრძელვადიანი ფუნქციონირება და სწრაფად პრობლემების მოგვარება.

source: Creative Thinking
ka: შემოქმედებითი აზროვნება

source: Strong ability to think creatively and approach problems from innovative angles, developing unique solutions and enhancing project outcomes.
ka: ძლიერი უნარი შემოქმედებით აზროვნებაში და პრობლემების ინოვაციური ხედვით გადაწყვეტაში, უნიკალური გადაწყვეტილებების შექმნა და პროექტის შედეგების გაუმჯობესება.

source: My Work
ka: ჩემი სამუშაოები

source: See more
ka: ნახე მეტი

source: Contact now
ka: დაგვიკავშირდი

source: © 2025 Saba Dumbadze
ka: © 2025 საბა დუმბაძე
